//Пользователь вводит число a
Console.Write("Введите a = ");
int a = Convert.ToInt32(Console.ReadLine());

if ( a % 2 < 0)
{
  Console.Write("да");  
}
else
{
  Console.Write("нет");  
}