//Пользователь вводит число a
Console.Write("Введите a = ");
int a = Convert.ToInt32(Console.ReadLine());